In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("data/nas.csv")

In [3]:
df

,STUID,State,District,Gender,Age,Category,Same.language,Siblings,Handicap,Father.edu,...,Express.science.views,Watch.TV,Read.magazine,Read.a.book,Play.games,Help.in.household,Maths..,Reading..,Science..,Social..
0,26011001001,Maharashtra,1,Girl,13 years,3.0,2.0,1 sibling,No,Illiterate,...,Agree,Every day,Never,Once a month,Once a week,Every day,NaN,33.33,NaN,NaN
1,26011001002,Maharashtra,1,Girl,15 years,3.0,2.0,3 siblings,No,NaN,...,Agree,Once a week,Never,Never,Once a week,Every day,NaN,62.07,NaN,NaN
2,26011001003,Maharashtra,1,Girl,14 years,3.0,2.0,3 siblings,No,Degree & above,...,Agree,Every day,Once a month,Once a month,Once a week,Every day,NaN,41.38,NaN,NaN
3,26011001004,Maharashtra,1,Boy,13 years,3.0,2.0,3 siblings,No,Secondary,...,Agree,Every day,Every day,Never,Every day,Every day,29.82,NaN,NaN,NaN
4,26011001005,Maharashtra,1,Girl,14 years,3.0,2.0,2 siblings,No,Primary,...,Neither,Never,Never,Once a month,Once a week,Every day,NaN,NaN,27.27,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8796,26141270036,Maharashtra,14,Boy,13 years,4.0,1.0,1 sibling,No,Secondary,...,Agree,Every day,Every day,Once a week,Every day,Every day,NaN,NaN,34.55,30.61
8797,26141270037,Maharashtra,14,Boy,13 years,3.0,1.0,2 siblings,No,NaN,...,Agree,Every day,Every day,Once a week,Once a week,Once a month,16.95,46.67,NaN,NaN
8798,26141270038,Maharashtra,14,Boy,14 years,4.0,1.0,1 sibling,No,Sr secondary,...,Agree,Every day,Every day,Once a week,Every day,Every day,24.56,55.17,NaN,NaN
8799,26141270039,Maharashtra,14,Boy,13 years,4.0,NaN,1 sibling,No,Sr secondary,...,Agree,Once a week,Once a week,Never,Every day,Every day,NaN,NaN,23.64,34.69
8800,26141270040,Maharashtra,14,Boy,13 years,4.0,NaN,1 sibling,No,Sr secondary,...,Agree,Once a week,Once a week,Once a week,Every day,Every day,NaN,NaN,27.27,30.61

In [4]:
df.columns

Index(['STUID', 'State', 'District', 'Gender', 'Age', 'Category',
       'Same.language', 'Siblings', 'Handicap', 'Father.edu', 'Mother.edu',
       'Father.occupation', 'Mother.occupation', 'Below.poverty',
       'Use.calculator', 'Use.computer', 'Use.Internet', 'Use.dictionary',
       'Read.other.books', 'X..Books', 'Distance', 'Computer.use',
       'Library.use', 'Like.school', 'Subjects', 'Give.Lang.HW',
       'Give.Math.HW', 'Give.Scie.HW', 'Give.SoSc.HW', 'Correct.Lang.HW',
       'Correct.Math.HW', 'Correct.Scie.HW', 'Correct.SocS.HW',
       'Help.in.Study', 'Private.tuition', 'English.is.difficult',
       'Read.English', 'Dictionary.to.learn', 'Answer.English.WB',
       'Answer.English.aloud', 'Maths.is.difficult', 'Solve.Maths',
       'Solve.Maths.in.groups', 'Draw.geometry', 'Explain.answers',
       'SocSci.is.difficult', 'Historical.excursions', 'Participate.in.SocSci',
       'Small.groups.in.SocSci', 'Express.SocSci.views',
       'Science.is.difficult', 'Observe.experiments', 'Conduct.experiments',
       'Solve.science.problems', 'Express.science.views', 'Watch.TV',
       'Read.magazine', 'Read.a.book', 'Play.games', 'Help.in.household',
       'Maths..', 'Reading..', 'Science..', 'Social..'],
      dtype='object')

In [15]:
df2 = df[['Mother.edu', 'Siblings']]

In [16]:
df2.head()

   Mother.edu    Siblings
0  Illiterate   1 sibling
1  Illiterate  3 siblings
2  Illiterate  3 siblings
3   Secondary  3 siblings
4  Illiterate  2 siblings

In [17]:
df2["Siblings"] = df2["Siblings"].apply(lambda x: 0 if x == "" else x.split(" ")[0])

<ipython-input-17-731de10f0c82>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2["Siblings"] = df2["Siblings"].apply(lambda x: 0 if x == "" else x.split(" ")[0])

In [19]:
df2.dtypes

Mother.edu    object
Siblings      object
dtype: object

In [21]:
# df2["Siblings"] = df2["Siblings"].astype("int32")
df2['Siblings'].value_counts()

2         2979
1         2726
3         1526
4+        1167
Single     403
Name: Siblings, dtype: int64

In [23]:
df2.corr()

Empty DataFrame
Columns: []
Index: []

In [26]:
df2[df2["Mother.edu"] == "Illiterate"]['Siblings'].value_counts()

2         923
1         533
3         532
4+        469
Single     88
Name: Siblings, dtype: int64

In [29]:
df3 = df[['Father.edu', 'Age', 'Science..']]

In [30]:
df3.head()

       Father.edu       Age  Science..
0      Illiterate  13 years        NaN
1             NaN  15 years        NaN
2  Degree & above  14 years        NaN
3       Secondary  13 years        NaN
4         Primary  14 years      27.27

In [31]:
df3['Age'].value_counts()

14 years     4349
13 years     2798
15 years      844
12 years      298
16+ years     264
11- years      16
Name: Age, dtype: int64

In [34]:
df3 = df3[df3["Age"] != "11- years" ]

In [35]:
df3['Age'].value_counts()

14 years     4349
13 years     2798
15 years      844
12 years      298
16+ years     264
Name: Age, dtype: int64

In [40]:
dfDgA = df3[df3["Father.edu"] == "Degree & above" ]
dfDgA["Science.."].describe()

count    156.000000
mean      43.519872
std       13.604071
min       16.360000
25%       34.095000
50%       43.640000
75%       51.365000
max       76.360000
Name: Science.., dtype: float64

In [41]:
df3["Science.."].describe()

count    4137.000000
mean       36.317140
std        13.188759
min         0.000000
25%        27.270000
50%        34.550000
75%        43.640000
max        85.450000
Name: Science.., dtype: float64

In [50]:
df14y = dfDgA[dfDgA["Age"] == "14 years"]
df13y = dfDgA[dfDgA["Age"] == "13 years"]
df15y = dfDgA[dfDgA["Age"] == "15 years"]
df12y = dfDgA[dfDgA["Age"] == "12 years"]
df16Py = dfDgA[dfDgA["Age"] == "16+ years"]

In [51]:
df14y.mean()

Science..    42.676944
dtype: float64

In [52]:
df13y.mean()

Science..    44.805143
dtype: float64

In [53]:
df15y.mean()

Science..    29.09
dtype: float64

In [54]:
df12y.mean()

Science..    46.752857
dtype: float64

In [55]:
df16Py.mean()

Science..    32.73
dtype: float64

In [56]:
dfDgA["Science.."].describe()

count    156.000000
mean      43.519872
std       13.604071
min       16.360000
25%       34.095000
50%       43.640000
75%       51.365000
max       76.360000
Name: Science.., dtype: float64

In [57]:
df["Science.."].describe()

count    4144.000000
mean       36.313272
std        13.199105
min         0.000000
25%        27.270000
50%        34.550000
75%        43.640000
max        85.450000
Name: Science.., dtype: float64